In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv('/content/loan_data.csv.zip')
df

      Loan_ID  Gender Married  ... Credit_History Property_Area Loan_Status
0    LP001002    Male      No  ...            1.0         Urban           Y
1    LP001003    Male     Yes  ...            1.0         Rural           N
2    LP001005    Male     Yes  ...            1.0         Urban           Y
3    LP001006    Male     Yes  ...            1.0         Urban           Y
4    LP001008    Male      No  ...            1.0         Urban           Y
..        ...     ...     ...  ...            ...           ...         ...
609  LP002978  Female      No  ...            1.0         Rural           Y
610  LP002979    Male     Yes  ...            1.0         Rural           Y
611  LP002983    Male     Yes  ...            1.0         Urban           Y
612  LP002984    Male     Yes  ...            1.0         Urban           Y
613  LP002990  Female      No  ...            0.0     Semiurban           N

[614 rows x 13 columns]

In [ ]:
df.head(5)

    Loan_ID Gender Married  ... Credit_History Property_Area Loan_Status
0  LP001002   Male      No  ...            1.0         Urban           Y
1  LP001003   Male     Yes  ...            1.0         Rural           N
2  LP001005   Male     Yes  ...            1.0         Urban           Y
3  LP001006   Male     Yes  ...            1.0         Urban           Y
4  LP001008   Male      No  ...            1.0         Urban           Y

[5 rows x 13 columns]

In [ ]:
df.tail(5)

      Loan_ID  Gender Married  ... Credit_History Property_Area Loan_Status
609  LP002978  Female      No  ...            1.0         Rural           Y
610  LP002979    Male     Yes  ...            1.0         Rural           Y
611  LP002983    Male     Yes  ...            1.0         Urban           Y
612  LP002984    Male     Yes  ...            1.0         Urban           Y
613  LP002990  Female      No  ...            0.0     Semiurban           N

[5 rows x 13 columns]

In [ ]:
df.describe()

       ApplicantIncome  CoapplicantIncome  ...  Loan_Amount_Term  Credit_History
count       614.000000         614.000000  ...         600.00000      564.000000
mean       5403.459283        1621.245798  ...         342.00000        0.842199
std        6109.041673        2926.248369  ...          65.12041        0.364878
min         150.000000           0.000000  ...          12.00000        0.000000
25%        2877.500000           0.000000  ...         360.00000        1.000000
50%        3812.500000        1188.500000  ...         360.00000        1.000000
75%        5795.000000        2297.250000  ...         360.00000        1.000000
max       81000.000000       41667.000000  ...         480.00000        1.000000

[8 rows x 5 columns]

In [ ]:
df['LoanAmount'].describe()

count    592.000000
mean     146.412162
std       85.587325
min        9.000000
25%      100.000000
50%      128.000000
75%      168.000000
max      700.000000
Name: LoanAmount, dtype: float64

In [ ]:
df['LoanAmount'].sum()

86676.0

In [ ]:
df['Loan_Amount_Term'].describe()

count    600.00000
mean     342.00000
std       65.12041
min       12.00000
25%      360.00000
50%      360.00000
75%      360.00000
max      480.00000
Name: Loan_Amount_Term, dtype: float64

In [ ]:
df['Loan_Amount_Term'].sum()

205200.0

In [ ]:
df['Gender'].describe() #male the most

count      601
unique       2
top       Male
freq       489
Name: Gender, dtype: object

In [ ]:
df['Education'].describe()

count          614
unique           2
top       Graduate
freq           480
Name: Education, dtype: object

In [ ]:
df['all_applicant']=df['ApplicantIncome']+df['CoapplicantIncome']
df['all_applicant']

0      5849.0
1      6091.0
2      3000.0
3      4941.0
4      6000.0
        ...
609    2900.0
610    4106.0
611    8312.0
612    7583.0
613    4583.0
Name: all_applicant, Length: 614, dtype: float64

In [ ]:
df['all_applicant'].sum()

4313168.91998864

In [ ]:
df['all_applicant'].describe()

count      614.000000
mean      7024.705081
std       6458.663872
min       1442.000000
25%       4166.000000
50%       5416.500000
75%       7521.750000
max      81000.000000
Name: all_applicant, dtype: float64

In [ ]:
df

      Loan_ID  Gender Married  ... Property_Area Loan_Status all_applicant
0    LP001002    Male      No  ...         Urban           Y        5849.0
1    LP001003    Male     Yes  ...         Rural           N        6091.0
2    LP001005    Male     Yes  ...         Urban           Y        3000.0
3    LP001006    Male     Yes  ...         Urban           Y        4941.0
4    LP001008    Male      No  ...         Urban           Y        6000.0
..        ...     ...     ...  ...           ...         ...           ...
609  LP002978  Female      No  ...         Rural           Y        2900.0
610  LP002979    Male     Yes  ...         Rural           Y        4106.0
611  LP002983    Male     Yes  ...         Urban           Y        8312.0
612  LP002984    Male     Yes  ...         Urban           Y        7583.0
613  LP002990  Female      No  ...     Semiurban           N        4583.0

[614 rows x 14 columns]

In [ ]:
df.sort_values(by=['all_applicant'],ascending=True)

      Loan_ID  Gender Married  ... Property_Area Loan_Status all_applicant
28   LP001086    Male      No  ...         Urban           N        1442.0
338  LP002113  Female      No  ...         Urban           N        1830.0
583  LP002898    Male     Yes  ...         Rural           N        1880.0
216  LP001722    Male     Yes  ...         Rural           N        1950.0
403  LP002300  Female      No  ...     Semiurban           Y        1963.0
..        ...     ...     ...  ...           ...         ...           ...
600  LP002949  Female      No  ...         Urban           N       42083.0
185  LP001640    Male     Yes  ...     Semiurban           Y       43897.0
171  LP001585     NaN     Yes  ...         Urban           Y       51763.0
333  LP002101    Male     Yes  ...         Urban           Y       63337.0
409  LP002317    Male     Yes  ...         Rural           N       81000.0

[614 rows x 14 columns]

In [ ]:
df['Loan_Status'].describe()

count    600.00000
mean     342.00000
std       65.12041
min       12.00000
25%      360.00000
50%      360.00000
75%      360.00000
max      480.00000
Name: Loan_Amount_Term, dtype: float64

In [ ]:
df.corr()

                   ApplicantIncome  ...  all_applicant
ApplicantIncome           1.000000  ...       0.893037
CoapplicantIncome        -0.116605  ...       0.342781
LoanAmount                0.570909  ...       0.624621
Loan_Amount_Term         -0.045306  ...      -0.069948
Credit_History           -0.014715  ...      -0.015109
all_applicant             0.893037  ...       1.000000

[6 rows x 6 columns]

In [ ]:
df.values

array([['LP001086', 'Male', 'No', ..., 'Urban', 'N', 1442.0],
       ['LP002113', 'Female', 'No', ..., 'Urban', 'N', 1830.0],
       ['LP002898', 'Male', 'Yes', ..., 'Rural', 'N', 1880.0],
       ...,
       ['LP001585', nan, 'Yes', ..., 'Urban', 'Y', 51763.0],
       ['LP002101', 'Male', 'Yes', ..., 'Urban', 'Y', 63337.0],
       ['LP002317', 'Male', 'Yes', ..., 'Rural', 'N', 81000.0]],
      dtype=object)

In [ ]:
(df['Gender']=='Female').value_counts()

False    502
True     112
Name: Gender, dtype: int64

In [ ]:
(df['Married']=='Yes').value_counts()

True     398
False    216
Name: Married, dtype: int64

In [ ]:
(df['Dependents']=='0').value_counts()

True     345
False    269
Name: Dependents, dtype: int64

In [ ]:
df['Dependents'].value_counts()

0     345
1     102
2     101
3+     51
Name: Dependents, dtype: int64

In [ ]:
((df['Loan_Status']=='Y') & (df['Dependents']>'0')&(df['Gender']=='Female')).value_counts() #female are less than male (that has loan status = yes and has dependents )

False    595
True      19
dtype: int64

In [ ]:
((df['Loan_Status']=='N') & (df['Married']=='Yes')).value_counts()

False    501
True     113
dtype: int64

In [ ]:
(df['Loan_Status']=='N').value_counts()

False    422
True     192
Name: Loan_Status, dtype: int64

In [ ]:
((df['Loan_Status']=='N') & (df['Gender']=='Male')).value_counts() #male has Loan_Status = no are less than female

False    464
True     150
dtype: int64

In [ ]:
df['']

In [ ]:
df['Property_Area'].describe() #Semiurban the most country takes loan

count           614
unique            3
top       Semiurban
freq            233
Name: Property_Area, dtype: object

In [ ]:
df.index

Int64Index([ 28, 338, 583, 216, 403, 305, 541, 587, 186, 407,
            ...
            506, 183, 581, 443, 155, 600, 185, 171, 333, 409],
           dtype='int64', length=614)